#2) დაატრიალეთ ციკლი while loop ის გამოყენებით 1 დან 30 მდე

i=1
while i < 30: 
    print(i)
    i = i + 1
#3)დაატრიალეთ ციკლი while loop ის გამოყენებით 10 დან 20მდე

i = 10
while i < 20:
    print(i)
    i = i + 1
#3)დაატრიალეთ ციკლი while loop ის გამოყენებით 0 დან 30მდე ისერომ დაბეჭდოთ მხოლო ლუწი რიცხვები if ის გამოყენებით

i = 1
while i < 30:
    if i % 2 == 0:
        print(i)
    i = i + 1

#4)დაატრიალეთ ციკლი while loop ის გამოყენებით 5 დან 50მდე ისერომ დაბეჭდოთ მხოლოდ კენტი რიცხვები

i = 5 
while i < 50 :
    if i % 2 != 0: 
        print(i)
    i = i + 1